Tekla.Structures.Catalogs.UserPropertyVisibilityEnum
The visibility of the user property.

Tekla.Structures.Catalogs.UserPropertyVisibilityEnum.VISIBILITY_NORMAL
The user property is visible and the user can modify it.

Tekla.Structures.Catalogs.UserPropertyVisibilityEnum.VISIBILITY_READONLY
The user property is visible but the user cannot modify it.

Tekla.Structures.Catalogs.UserPropertyVisibilityEnum.VISIBILITY_HIDDEN
The user property is hidden.